<!DOCTYPE html>
<html lang="es">
    <head>
        <title>Alan Turing</title>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <link href="css/style.css" rel="stylesheet">
    </head>
    <body>
        <h1>BIOGRAFIA: ALAN TURING</h1> 
        <h2>(1912-1954)</h2>
        <img src="img/turing.jpeg" ALIGN=MIDDLE alt="Imagen de Alan Turing">
        <!--comentario-->
        <br><br><br>
        <a href="#1936">M&aacute;quina de Turing</a>
        <a href="#1937">Funciones computables</a>
        <a href="#1938">Noci&oacute;n de ordinal l&oacute;gica</a>
        <a href="#1939">Enigma</a>
        <a href="#1942">Bombe</a>
        <a href="#1945">ACE</a>
        <a href="#1948">Manchester Mark I</a>
        <a href="#1950">Prueba de Turing</a>
        <a href="#1952">Modelo Racci&oacute;n-Difusi&oacute;n</a>
        <a href="#19521">Modelo matem&aacute;tico</a>
        <a href="#19522">Arresto</a>
        <a href="#1954">Muerte</a>
        <br><br><br><hr>
        <h3 id="1936">M&aacute;quina de Turing</h3>
        <p>1936: Turing propuso la idea de la M&aacute;quina de Turing en su art&iacute;culo "On Computable Numbers, with an Application to the Entscheidungsproblem".</p>
        <br><hr>
        <h3 id="1937">Funciones computables</h3>
        <p>1937: Desarroll&oacute; el concepto de funciones computables, sentando las bases de la teor&iacute;a de la computabilidad.</p>
        <br><hr>
        <h3 id="1938">Noci&oacute;n de ordinal l&oacute;gica</h3>
        <p>1938: Public&oacute; su trabajo "Systems of LogicBased on Ordinals", donde introdujo la noci&oacute;n de ordinal l&oacute;gica.</p>
        <br><hr>
        <h3 id="1939">Enigma</h3>
        <p>1939: Trabaj&oacute; en Bletchley Park durante la Segunda Guerra Mundial, contribuyendo al descifrado de los c&oacute;digos de la m&aacute;quina Enigma utilizada por las fuerzas alemanas.</p>
        <br><hr>
        <h3 id="1942">Bombe</h3>
        <p>1942: Desarroll&oacute; la m&aacute;quina Bombe, una m&aacute;quina electromec&aacute;nica utilizada para descifrar mensajes Enigma.</p>
        <br><hr>
        <h3 id="1945">ACE</h3>
        <p>1945: Trabj&oacute; en el diseño de la ACE (Automatic Computing Engine), una de las primeras computadoras electr&oacute;nicas de pr&oacute;posito general.</p>
        <br><hr>
        <h3 id="1948">Manchester Mark I</h3>
        <p>1948: IAyud&oacute; a diseñar el Manchester Mark I, una de las primeras computadoras de programa almacenado.</p>
        <br><hr>
        <h3 id="1950">Prueba de Turing</h3>
        <p>1950: Public&oacute; "Computing Machinery and Intelligence", donde propuso la Prueba de Turing como un criterio para la inteligencia artificial.</p>
        <br><hr>
        <h3 id="1952">Modelo Racci&oacute;n-Difusi&oacute;n</h3>
        <p>1952: Public&oacute; "The Chemical Basis of Morphogenesis", donde present&oacute; su modelo de Reacci&oacute;n-Difusi&oacute;n para explicar patrones biol&oacute;gicos.</p>
        <br><hr>
        <h3 id="19521">Modelo matem&aacute;tico</h3>
        <p>1952: Public&oacute; "The Chemical Basis of Morphogenesis", proponiendo un modelo matem&aacute;tico para explicar c&oacute;mo los patrones biol&oacute;gicos complejos pueden surgir a partir de interacciones simples.</p>
        <br><hr>
        <h3 id="19522">Arresto</h3>
        <p>1952: Acudi&oacute; a la polic&iacute;a para denunciar un robo y durante la declaración indic&oacute; su homosexualidad, por lo que fue acusado de indecencia grave y perversi&oacute;n sexual, considerados delitos graves en el Reino Unido por entonces.</p>
        <br><hr>
        <h3 id="1954">Muerte</h3>
        <p>1954: Muri&oacute; tras suministrarse un veneno, quiz&aacute; por accidente.</p>
        <br><hr>
    </body>
</html>